문제가 원하는 것
    
print : actual - miscalculated ==> error gap
employee - employee except 0
context : round, up to next integer. ==> select round
    


---------------------------------------------------------------

--> 0을 추출하여 제거할 수 있나? ⇒ 추출 + 제거

REPLACE(컬럼명, '찾을문자', '변환문자')
SELECT REPLACE(Salary, '0', '')

되는 것 같다.

---------------------------------------------------------------     


그럼 0을 추출하고 제거하는 쿼리를 서브쿼리로 만들고
employee.salary - 서브쿼리
⇒ 차이값 도출할 수 있을 것 같음.
그런데 차이값이 결과값으로 나오려면 select에 들어가야 한다고 판단.


---------------------------------------------------------------

--> select로 뽑을 때 - 를 넣을 수 있을까?
integer일 경우 -만 넣어서 계산 가능할 것 같다

SELECT (Salary - REPLACE(Salary, '0', ''))
from employees

틀림

---------------------------------------------------------------


구글링


-- 놓쳤던 것
--> 평균을 구하라


---------------------------------------------------------------

-- AVG 더함

SELECT round(AVG(Salary) - AVG(REPLACE(Salary, '0', '')))
from employees

틀림
---------------------------------------------------------------

구글링

-- 문제 해석이 잘못된 거였음.
-- round = 반올림, ceil = 올림.


--정답----------------------------------------------------------
select ceil(AVG(Salary) - AVG(replace(Salary, '0', '')))
from employees
---------------------------------------------------------------